Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 07-Bow-Wow-and-Mew-Mew/CAT/corpus-genesis-ylt.en.utf8.tmx
Source language: en
Languages: chr

source: And the eyes of Israel have been heavy from age, he is unable to see; and he bringeth them nigh unto him, and he kisseth them, and cleaveth to them;
chr: ᎢᏏᎵᏃ ᏗᎦᏙᎵ ᎿᏉ ᏧᏍᎪᎸᎢ ᎨᏎ ᎠᎦᏴᎵᏴ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᎢ, ᎠᎴ ᎥᏝ ᎬᏩᎪᏩᏛᏗ ᏱᎨᏎᎢ. ᎾᎥᏃ ᏚᏘᏃᎮᎴᎢ; ᏚᏔᏪᏙᏁᏃ, ᎠᎴ ᏚᏄᎶᎴᎢ.

source: and Israel saith unto Joseph, 'To see thy face I had not thought, and lo, God hath shewed me also thy seed.'
chr: ᎢᏏᎵᏃ ᎯᎠ ᏄᏪᏎᎴ ᏦᏩ, ᏣᎧᏛ ᎠᎩᎪᏩᏛᏗᏱ ᎥᏝ ᏱᎦᏓᏅᏖᏍᎨᎢ; ᎬᏂᏳᏉᏃ ᎤᏁᎳᏅᎯ ᏗᏤᏥ ᎾᏍᏉ ᏗᏥᎪᏩᏛᏗᏱ ᎾᏋᏂᏏ.

source: And Joseph bringeth them out from between his knees, and boweth himself on his face to the earth;
chr: ᏦᏩᏃ ᏚᏪᎧᎲᏎ [ᏤᎦᏈ] ᏗᎧᏂᎨᏂ ᎠᏰᎵ ᏓᏂᏙᎬᎢ, ᎠᎴ ᎡᎳᏗ ᏄᏛᏁᎴ ᎦᏙᎯ ᎢᏴᏛ ᎤᎵᏯᏍᏚᏁᎢ.

source: and Joseph taketh them both, Ephraim in his right hand towards Israel's left, and Manasseh in his left towards Israel's right, and bringeth [them] nigh to him.
chr: ᏦᏩᏃ ᎢᏧᎳ ᏚᏬᏯᏁᏎᎢ, ᎢᏆᎻ ᎠᎦᏘᏏᏗᏢ ᎤᏬᏯᏁᏍᏔᏁᎢ ᎢᏏᎵ ᎠᎦᏍᎦᏂᏗᏢ ᎨᏒ ᎤᏪᎧᏁᎢ, ᎻᎾᏌᏃ ᎠᎦᏍᎦᏂᏗᏢ ᎤᏬᏯᏁᏍᏔᏁᎢ ᎢᏏᎵ ᎠᎦᏘᏏᏗᏢ ᎤᏪᎧᏁᎢ, ᎠᎴ ᎾᎥ ᏚᏘᏃᎮᎴᎢ.

source: And Israel putteth out his right hand, and placeth [it] upon the head of Ephraim, who [is] the younger, and his left hand upon the head of Manasseh; he hath guided his hands wisely, for Manasseh [is] the first-born.
chr: ᎢᏏᎵᏃ ᎠᎦᏘᏏᏗᏢ ᎤᏙᏯᏅᎯᏕᎢ, ᎠᎴ ᎢᏆᎻ ᎠᏍᎪᎵ ᎤᏏᏔᏕᎢ, ᎾᏍᎩ ᎣᏂ ᎡᎯ ᏥᎨᏎᎢ, ᎠᎦᏍᎦᏂᏃ ᎢᏗᏢ ᎻᎾᏌ ᎠᏍᎪᎵ ᎤᏏᏔᏕᎢ, ᎠᏙᎴᎰᏍᎨ ᏂᏕᎬᏁᎲ ᏧᏬᏰᏂ; ᎻᎾᏌᏰᏃ ᎤᏓᏂᎵᎨ ᎨᏎᎢ.

source: And he blesseth Joseph, and saith, 'God, before whom my fathers Abraham and Isaac walked habitually: God who is feeding me from my being unto this day:
chr: ᎣᏍᏛᏃ ᎤᏁᏤᎴ ᏦᏩ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎢ, ᎤᏁᎳᏅᎯ ᎾᏍᎩ ᎠᎦᏔᎲ ᎤᏁᏙᎸᎯ ᏥᎩ ᏗᎩᎦᏴᎵᎨ ᎡᏆᎭᎻ, ᎠᎴ ᎡᏏᎩ, ᎤᏁᎳᏅᎯ ᎾᏍᎩ ᎠᏇᎶᎸᎯ ᏥᎩ ᎠᏆᎴᏂᏙᎸ ᎢᎪᎯᏛ ᎪᎯ ᎨᏒ ᎢᏯᏍᏗ,

source: the Messenger who is redeeming me from all evil doth bless the youths, and my name is called upon them, and the name of my fathers Abraham and Isaac; and they increase into a multitude in the midst of the land.'
chr: ᏗᎧᎿᏩᏗᏙᎯ ᎾᏍᎩ ᏄᏓᎴᏒ ᎤᏲ ᎠᏊᏓᎴᏛ ᏥᎩ, ᎣᏍᏛ ᏫᏂᏓᏛᏂᏏ ᎯᎠ ᎠᏂᏫᏄᏣ; ᎠᎴ ᎠᏴ ᏓᏆᏙᎥ ᏫᏓᎾᏙᏍᏓ, ᎠᎴ ᏚᎾᏙᎥ ᏗᎩᎦᏴᎵᎨ ᎠᏆᎭᎻ ᎠᎴ ᎡᏏᎩ; ᎠᎴ ᎤᏂᏣᏘ ᏫᎾᎾᎵᏍᏓ ᎾᎿ ᎠᏰᎵ ᎨᏒ ᎡᎶᎯ.

source: And Joseph seeth that his father setteth his right hand on the head of Ephraim, and it is wrong in his eyes, and he supporteth the hand of his father to turn it aside from off the head of Ephraim to the head of Manasseh;
chr: ᏦᏩᏃ ᎡᏙᎴᎰᏒ ᎤᏙᏓ ᎢᏆᎻ ᎠᏍᎪᎵ ᎠᎦᏘᏏᏗᏢ ᎤᏏᏔᏛᎢ ᎡᏍᎦ ᎤᏰᎸᏁᎢ; ᎠᎴ ᎤᏌᎳᏓᏁ ᎤᏙᏓ ᎤᏬᏰᏂ, ᎣᏏᏘᏴᏍᏗᏱ ᎢᏆᎻ ᎠᏍᎪᎵ ᎣᏏᏔᏛᎢ, ᎠᎴ ᎻᎾᏌ ᎠᏍᎪᎵ ᏭᏏᏔᏗᏍᏗᏱ.

source: and Joseph saith unto his father, 'Not so, my father, for this [is] the first-born; set thy right hand on his head.'
chr: ᏦᏩᏃ ᎯᎠ ᏄᏪᏎᎴ ᎤᏙᏓ, ᎥᏞᏍᏗ ᎡᏙᏓ; ᎯᎠᏰᏃ ᎢᎬᏱ ᎤᏕᏅᎯ; ᎯᎦᏘᏍᏗᏢ ᎾᏍᎩ ᎠᏍᎪᎵ ᎯᏯᏏᏔᏓ.

source: And his father refuseth, and saith, 'I have known, my son, I have known; he also becometh a people, and he also is great, and yet, his young brother is greater than he, and his seed is the fulness of the nations;'
chr: ᎤᏙᏓᏃ ᏚᏢᏫᏎᎴ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎢ, ᏥᎦᏔᎭ ᎠᏇᏥ, ᏥᎦᏔᎭ; ᎾᏍᎩ ᎾᏍᏉ ᎤᏂᏣᏘ ᏴᏫ ᏅᏓᎦᎵᏍᏔᏂ, ᎠᎴ ᎾᏍᏉ ᎠᏥᎸᏉᏗᏳ ᎨᏎᏍᏗ; ᎠᏎᏃ ᎤᏙᎯᏳᎯᏯ ᎤᏅᏟ ᎤᏟ ᎠᏥᎸᏉᏗᏳ ᎨᏎᏍᏗ ᎡᏍᎦᏉ ᎾᏍᎩ, ᎠᎴ ᎾᏍᎩ ᎤᏁᏢᏔᏅᎯ ᎤᏂᏧᏈᏍᏗ ᎤᎾᏓᏤᎵᏛ ᏴᏫ ᏅᏛᎾᎵᏍᏔᏂ.

source: and he blesseth them in that day, saying, 'By thee doth Israel bless, saying, God set thee as Ephraim and as Manasseh;' and he setteth Ephraim before Manasseh.
chr: ᎠᎴ ᎣᏍᏛ ᏚᏁᏤᎴ ᎾᎯᏳ ᎢᎦ, ᎯᎠ ᏄᏪᏎᎢ, ᏂᎯ ᎨᏨᏗᏍᎨᏍᏗ ᎢᏏᎵ ᎣᏍᏛ ᏓᎾᏓᏁᏤᎮᏍᏗ, ᎯᎠ ᎾᏂᏪᏍᎨᏍᏗ, ᎤᏁᎳᏅᎯ ᎢᏆᎻ ᎠᎴ ᎻᎾᏌ ᏄᎾᏍᏛ ᎾᏍᎩᏯ ᏫᏂᏨᎦ; ᎠᎴ ᎢᏆᎻ ᎢᎬᏱ ᎤᎴᏓᏁᎴ ᎻᎾᏌ.

source: And Israel saith unto Joseph, 'Lo, I am dying, and God hath been with you, and hath brought you back unto the land of your fathers;
chr: ᎢᏏᎵᏃ ᎯᎠ ᏄᏪᏎᎴ ᏦᏩ, ᎬᏂᏳ ᏓᏥᏲᎤᏏ; ᎠᏎᏃ ᎤᏁᎳᏅᎯ ᏕᏥᎧᎿᏩᏗᏙᎮᏍᏗ, ᎠᎴ ᏔᎵᏁ ᏫᏙᏛᏣᏘᏃᎵ ᏗᏥᎦᏴᎵᎨ ᏧᎾᏤᎵ ᎦᏓ ᏗᎲᎢ.

source: and I -- I have given to thee one portion above thy brethren, which I have taken out of the hand of the Amorite by my sword and by my bow.'
chr: ᎠᎴ ᎾᏍᏉ ᎠᏴ ᏌᏉ ᎢᏯᏯᏙᎸᎯ ᎤᏓᎪᎾᏛᏗ ᏂᎯ ᎬᎥᏏ, ᎡᏍᎦ ᎢᏣᎵᏅᏟ, ᎾᏍᎩ ᎠᏂᎡᎼᎵ ᎦᏥᎩᎡᎸᎯ ᎠᏋᏔᏅᎯ ᎠᏆᏤᎵ ᎠᏰᎳᏍᏗ ᎦᏅᎯᏛ ᎠᎴ ᎠᏆᏤᎵ ᎦᎶᏣᏗ.

source: Chapter 49
chr: ᎠᏯᏙᎸᎢ 49

source: And Jacob calleth unto his sons and saith, 'Be gathered together, and I declare to you that which doth happen with you in the latter end of the days.
chr: ᏤᎦᏈᏃ ᏫᏚᏯᏅᎮ ᏧᏪᏥ, ᎠᎴ ᎯᎠ ᏄᏪᏎᎢ, ᎢᏣᏓᏟᏌ, ᎾᏍᎩ ᎢᏳᏃᏁᏗᏱ ᏅᏗᏣᎵᏍᏓᏁᎵᏒ ᎣᏂ ᎠᎵᏰᎢᎵᏎᏍᏗ.

source: 'Be assembled, and hear, sons of Jacob, And hearken unto Israel your father.
chr: ᎢᏣᏓᏟᏌ, ᎠᎴ ᎢᏣᏛᏓᏍᏓ, ᏂᎯ ᏤᎦᏈ ᏧᏪᏥ; ᎠᎴ ᎡᏣᏛᏓᏍᏓᏏ ᎢᏏᎵ ᎢᏥᏙᏓ.

source: Reuben! my first-born thou, My power, and beginning of my strength, The abundance of exaltation, And the abundance of strength;
chr: ᎷᏈᏂ, ᏂᎯ ᎢᎬᏱ ᏍᏆᏕᏁᎸᎯ, ᎠᏆᎵᏂᎬᎬᎢ, ᎠᎴ ᎠᏓᎴᏂᏍᎬ ᎠᏆᎵᏂᎬᎬᎢ, ᎢᎬᏱ ᎦᏙᎩ ᎦᎸᏉᏗᏳ ᎨᏒ, ᎠᎴ ᎢᎬᏱ ᎦᏙᎩ ᎤᎵᏂᎩᏛ ᎨᏒᎢ;

source: Unstable as water, thou art not abundant; For thou hast gone up thy father's bed; Then thou hast polluted: My couch he went up!
chr: ᎠᎹ ᏥᎾᏩᎿ ᎾᏍᎩᏯ ᏂᏣᎿ, ᎥᏝ ᎢᎬᏱ ᎯᏙᎩ ᏱᎨᏎᏍᏗ, ᏂᎦᎵᏍᏙᏗᎭ ᏣᏙᏓ ᎤᏂᏏᏗᏱ ᏫᏣᎷᏨᎢ; ᎿᏉᏃ ᎾᏍᎩ ᏣᏐᏢᎢᏍᏔᏁᎢ; ᎠᏆᏤᏍᏙᎩᎯ ᏭᎷᏤᎢ.

source: Simeon and Levi [are] brethren! Instruments of violence -- their espousals!
chr: ᏏᎻᏯᏂ ᎠᎴ ᎵᏫ ᏗᎾᏓᏅᏟᏉ; ᎡᎯᏍᏗ ᎢᏗᏓᏛᏁᏙᏗ ᏚᏅᏴ ᎠᏁᎲᎢ.

source: Into their secret, come not, O my soul! Unto their assembly be not united, O mine honour; For in their anger they slew a man, And in their self-will eradicated a prince.
chr: ᎠᏆᏓᏅᏙ, ᏞᏍᏗ ᎠᏂᏙᎾᎥ ᏫᏣᎷᏨᎩ; ᎾᏍᎩ ᏓᏂᎳᏫᎥ ᏞᏍᏗ ᏣᏖᎳᏛᎩ, ᎠᏆᏤᎵᎦ ᎦᎸᏉᏗᏳ ᎨᏒᎢ; ᎤᏂᏔᎳᏬᏍᎬᏰᏃ ᏴᏫ ᎤᏂᎸᎩ, ᎠᎴ ᎤᏅᏒ ᎠᎾᏓᏅᏖᏍᎬ ᎾᎾᏛᏁᎲ ᏩᎦ ᏚᏅᏏᎳᏛ ᏚᏂᎦᎵᏒᎩ.

source: Cursed [is] their anger, for [it is] fierce, And their wrath, for [it is] sharp; I divide them in Jacob, And I scatter them in Israel.
chr: ᎠᏍᎦᏨᎯ ᎨᏎᏍᏗ ᎾᏍᎩ ᎤᏂᏔᎳᏬᏍᎬᎢ, ᎤᏍᎦᏎᏗᏳᏰᏃ ᎨᏒᎩ; ᎠᎴ ᎾᏍᎩ ᎤᏂᎿᎸᏒᎢ, ᎡᎯᏍᏗᏳᏰᏃ ᎢᏯᏓᏛᏁᎯ ᎨᏒᎩ, ᏤᎦᏈᏱ ᎨᏒ ᏔᎵ ᎤᏓᎦᏥᏯᏗ, ᎠᎴ ᎢᏏᎵᏱ ᎨᏒ ᏓᎦᏥᏯᏗᎦᎴᏯᏍᏔᏂ.

source: Judah! thou -- thy brethren praise thee! Thy hand [is] on the neck of thine enemies, Sons of thy father bow themselves to thee.
chr: ᏧᏓ, ᏂᎯ ᎾᏍᎩ ᎢᏣᎵᏅᏟ ᏨᏛᏂᎸᏉᏔᏂ; ᏂᎯ ᏦᏰᏂ ᎨᏣᏍᎦᎩ ᎠᏂᎩᎵᎨᏂ ᏕᎯᏂᏴᏎᏍᏗ, ᏣᏙᏓ ᏧᏪᏥ ᎡᎳᏗ ᏂᎨᏣᏛᏁᎮᏍᏗ.

source: A lion's whelp [is] Judah, For prey, my son, thou hast gone up; He hath bent, he hath crouched as a lion, And as a lioness; who causeth him to arise?
chr: ᏧᏓ ᏢᏓᏥ ᎤᏃᏕᎾ ᎤᏪᏥ; ᎠᏇᏥ, ᎠᎵᏍᏓᏴᏗ ᎯᏂᏴᏛ ᏨᏕᏨ; ᎤᏗᏌᏓᏛᎩ, ᎡᎳᏗ ᎤᏂᏏᏅᎩ, ᏢᏓᏥ ᏥᎾᏛᏁᎰ ᎾᏍᎩᏯᎢ, ᎠᎴ ᎤᏃᏕᎾ ᏢᏓᏥ ᎾᏍᎩᏯᎢ; ᎦᎪ ᎾᏍᎩ ᏓᏳᏖᏍᏔᏂ.

source: The sceptre turneth not aside from Judah, And a lawgiver from between his feet, Till his Seed come; And his [is] the obedience of peoples.
chr: ᎠᏙᎳᏅᏍᏗ ᎤᎬᏫᏳᎯ ᎤᏒᎦᎶᏗᏍᏗ ᎥᏝ ᎤᏓᏅᎡᏗ ᏱᎨᏎᏍᏗ ᏧᏓ, ᎠᎴ ᏗᎧᎿᏩᏛᏍᏗ ᎪᏢᏙᏗ ᎥᏝ ᎤᏓᏅᏍᏗ ᏱᎨᏎᏍᏗ ᏚᎳᏍᎬ ᎠᏰᎵ, ᎬᏂ ᏌᎶ ᎦᎷᏨᎭ; ᎠᎴ ᎾᏍᎩ ᎬᏬᎯᏳᎲᏍᎨᏍᏗ ᏴᏫ.

source: Binding to the vine his ass, And to the choice vine the colt of his ass, He hath washed in wine his clothing, And in the blood of grapes his covering;
chr: ᎤᏤᎵᎦ ᏗᎦᎵᎠᏅᎯᏛ ᎠᎩᎾ ᎤᏖᎸᎳᏛ ᎤᏪᎵᏌᏛᏅᎩ, ᎠᎴ ᎤᏤᎵᎦ ᎠᎩᏏ ᏗᎦᎵᎠᏅᎯᏛ ᎤᏪᏥ ᎦᎸᏉᏗ ᎤᏖᎸᎳᏛ ᎤᏪᎵᏌᏛᏅᎩ, ᏧᏄᏬ ᎩᎦᎨ ᎠᏗᏔᏍᏗᏱ ᏚᏮᎩᎶᎥᎩ, ᎠᎴ ᏖᎸᎳᏗ ᎤᏂᎩᎬᎯ ᏚᏮᎩᎶᎥᎩ ᏧᏄᏬᎢ.

source: Red [are] eyes with wine, And white [are] teeth with milk!
chr: ᎩᎦᎨ ᎠᏗᏔᏍᏗ ᎤᏗᏔᎲ ᏗᎦᏙᎵ ᏗᎩᎦᎨᎢᏳ ᎨᏎᏍᏗ, ᎤᏅᏗᏃ ᎤᏗᏔᎲ ᏕᎦᏄᏙᎬ ᏧᏁᎩᏳ ᎨᏎᏍᏗ.

source: Zebulun at a haven of the seas doth dwell, And he [is] for a haven of ships; And his side [is] unto Zidon.
chr: ᏤᏆᎳᏂ ᎠᎺᏉᎯ ᏥᏳ ᏗᏔᎳᏗᏍᏗᏱ ᎡᎮᏍᏗ; ᎠᎴ ᏥᏳ ᏗᏔᎳᏗᏍᏗᏱ ᎨᏎᏍᏗ ᎾᎿᏂ; ᎠᎴ ᎾᏍᎩ ᎤᏤᎵᎪᎯ ᎠᏟᎶᎥ ᏌᏙᏂ ᏩᏍᏕᏍᏗ.

source: Issacher [is] a strong ass, Crouching between the two folds;
chr: ᎢᏏᎦ ᏗᎦᎵᎠᏅᎯᏛ ᎤᎵᏂᎩᏛ, ᏗᏴᏙᏗᏱ ᎠᏰᎵ ᎦᏅᎦ.

source: And he seeth rest that [it is] good, And the land that [it is] pleasant, And he inclineth his shoulder to bear, And is to tribute a servant.
chr: ᎠᎴ ᎤᏙᎴᎰᏎ ᎠᏣᏪᏐᎸᏍᏙᏗᏱ ᎣᏏᏳ ᎨᏒᎢ, ᎠᎴ ᎦᏙᎯ ᎣᏏᏳ ᎨᏒᎢ; ᎠᎴ ᎦᏅᏬ ᎡᎳᏗ ᏄᏩᏁᎴ ᎠᎦᏃᎭᏢᏙᏗᏱ, ᎠᎴ ᎠᏥᏅᏏᏓᏍᏗ ᎠᏰᎵ ᎠᎫᏱᏍᎩ ᏄᎵᏍᏔᏁᎢ.

source: Dan doth judge his people, As one of the tribes of Israel;
chr: ᏕᏂ ᏕᎫᎪᏓᏁᎮᏍᏗ ᏧᏤᎵ ᏴᏫ, ᎾᏍᎩᏯ ᏌᏉ ᎾᏂᎳᏍᏓᎸ ᎢᏏᎵ.

source: Dan is a serpent by the way, An adder by the path, Which is biting the horse's heels, And its rider falleth backward.
chr: ᏕᏂ ᎢᎾᏛ ᎨᏎᏍᏗ ᏅᏃᎯ ᎦᏅᎨᏍᏗ, ᎢᎾᏛ ᎤᏅᏣᏛ ᏅᏃᎯ ᎦᏅᎨᏍᏗ, ᎾᏍᎩ ᏐᏈᎵ ᎦᏗᎨᏂ ᎠᏍᎦᎶᎩ, ᎤᎩᎸᏗᏃ ᏛᎰᏛᏥ.

source: For Thy salvation I have waited, Jehovah!
chr: ᏱᎰᏩ, ᏂᎯ ᏣᏓᏍᏕᎸᏗ ᎨᏒ ᎠᎩᎦᏘᏛ.

source: Gad! a troop assaulteth him, But he assaulteth last.
chr: ᎦᏗ ᏑᎾᏓᏡᎩ ᏓᎿᏩ ᎠᏁᏙᎯ ᏓᎬᏩᏕᏯᏙᏔᏂ, ᎠᏎᏃ ᎾᏍᎩ ᎣᏂ ᎠᏁᎩ ᏓᎨᎯᏒ ᏙᏛᏕᏯᏙᏔᏂ.

source: Out of Asher his bread [is] fat; And he giveth dainties of a king.
chr: ᎠᏌ, ᎠᎵᏍᏓᏴᏗ ᎤᏛᎯᏎᎸᎯ ᎦᎵᏦᎯᏗᏳ ᎨᏎᏍᏗ, ᎠᎴ ᎤᎬᏫᏳᎯ ᎣᏍᏛ ᎤᏰᎸᏗ ᎠᎵᏍᏓᏴᏗ ᎤᏛᎯᏎᎮᏍᏗ.

source: Naphtali [is] a hind sent away, Who is giving beauteous young ones.
chr: ᏁᏩᏔᎵ, ᎠᏫ ᎠᎩᏏ ᎨᎵᏌᏕᏛ ᎾᏍᎩᏯ; ᎤᏬᏚᎯ ᎦᏬᏂᏍᎩ.

source: Joseph [is] a fruitful son; A fruitful son by a fountain, Daughters step over the wall;
chr: ᏦᏩ ᎤᏣᏘ ᎠᏓᏛᏍᎩ ᎤᏩᏂᎦᎸᎢ, ᎤᏣᏘ ᎠᏓᏛᏍᎩ ᎤᏩᏂᎦᎸ ᎠᎹ ᎦᏄᎪᎬ ᎾᎥ ᏧᏰᎪᎢ; ᎾᏍᎩ ᏚᏩᏂᎦᎸ ᎠᏐᏴ ᏥᏓᏓᏬᎯᎳᏗᏍᎪᎢ.

source: And embitter him -- yea, they have striven, Yea, hate him do archers;
chr: ᎤᏣᏘ ᎡᎯᏍᏗ ᎬᏩᏓᏅᏓᏗᏍᏔᏅ, ᎠᎴ ᎦᏂ ᏚᎾᎵᏍᏙᎸ, ᎠᎴ ᎬᏩᎭᎷᏩᏕᎬᎩ ᎦᏂ ᏗᏂᏙᎯ.

source: And his bow abideth in strength, And strengthened are the arms of his hands By the hands of the Mighty One of Jacob, Whence is a shepherd, a son of Israel.
chr: ᎠᏎᏃ ᎤᏤᎵᎦ ᎦᎶᏣᏗ ᎤᎵᏂᎩᏛ ᎨᏒ ᏅᏩᏍᏛᏉ, ᎠᎴ ᏗᎧᏃᎨᏂ ᎠᎴ ᏧᏬᏰᏂ ᏚᎵᏂᎪᎯᏍᏓᏁᎲᎩ ᎤᎵᏂᎩᏛ [ᎤᏁᎳᏅᎯ] ᏤᎦᏈ ᎤᏤᎵᎦ; ᎾᎿ ᏗᏓᎴᎲᏍᎦ ᎠᏫ ᏗᎦᏘᏯ, ᏅᏯ ᎢᏏᎵ ᎤᏤᎵᎦ.

source: By the God of thy father who helpeth thee, And the Mighty One who blesseth thee, Blessings of the heavens from above, Blessings of the deep lying under, Blessings of breasts and womb; --
chr: ᎾᏍᎩ ᎤᏁᎳᏅᎯ ᏣᏙᏓ ᎤᏤᎵᎦ, ᎾᏍᎩ ᏣᏍᏕᎸᏗ ᏥᎩ; ᎠᎴ ᏫᎾᏍᏛᎾ ᎤᎵᏂᎩᏛ, ᎾᏍᎩ ᎣᏍᏛ ᎢᏣᏛᏁᏗ ᏥᎩ, ᏣᏁᎲ ᎣᏍᏛ ᎨᏒ ᎦᎸᎳᏗ ᏅᏓᏳᏓᎴᏅᎯ, ᎠᎴ ᎣᏍᏛ ᎨᏒ ᎠᎹᏱ ᏅᏓᏳᏓᎴᏅᎯ ᎾᏍᎩ ᎡᎳᏗᏢ ᏥᎦᏁᎭ, ᎣᏍᏛ ᎨᏒ ᏅᏓᏳᏓᎴᏅᎯ ᏓᎾᏓᏍᏛᏍᎬ ᎠᎴ ᏓᏂᏁᎵᎬᎢ.

source: Thy father's blessings have been mighty Above the blessings of my progenitors, Unto the limit of the heights age-during They are for the head of Joseph, And for the crown of the one Separate [from] his brethren.
chr: ᏣᏙᏓ ᎣᏍᏛ ᎤᏁᏨ ᎤᏓᎪᎾᏛᏔᏅ ᎣᏍᏛ ᎨᏒ ᏅᏓᏳᏓᎴᏅᎯ ᏙᏓᎸ ᏂᏓᎵᏍᏆᏗᏍᎬᎾ, ᎠᎴ ᎤᏚᎸᏗ ᎨᏒ ᏅᏓᏳᏓᎴᏅᎯ ᏙᏓᎸ ᏂᏓᎵᏛᏗᏍᎬᎾ; ᏦᏩ ᎠᏍᎪᎵ ᎤᎷᏤᏗ ᎨᏎᏍᏗ, ᎠᎴ ᎦᏚᎢ ᎠᏍᎪᎵ ᎾᏍᎩ ᎠᎾᎵᏅᏟ ᎠᏁᎲ ᎠᎦᏓᏓᎴᏔᏅᎯ ᏥᎨᏒᎩ.

source: Benjamin! a wolf teareth; In the morning he eateth prey, And at evening he apportioneth spoil.'
chr: ᏇᏂ ᎦᏓᎦᎸᎥᏍᎨᏍᏗ ᏩᏯ ᎾᏍᎩᏯᎢ; ᏑᎾᎴ ᎦᏰᏍᎨᏍᏗ ᎤᏂᏴᏛ, ᎤᏒᏃ ᎤᏓᏬᏅᏛ ᎠᏯᏙᎯᎮᏍᏗ.

source: All these [are] the twelve tribes of Israel, and this [is] that which their father hath spoken unto them, and he blesseth them; each according to his blessing he hath blessed them.
chr: ᎯᎠ ᎾᏍᎩ ᏂᎦᏛ ᏔᎳᏚ ᎾᏂᎳᏍᏓᎸ ᎢᏏᎵ; ᎠᎴ ᎾᏍᎩ ᎯᎠ ᎤᏂᏙᏓ ᏥᏚᏬᏁᏔᏁᎢ, ᎠᎴ ᎣᏍᏛ ᏥᏚᏁᏤᎴᎢ; ᎠᏂᏏᏴᏫᎭ ᎣᏍᏛ ᎢᏳᎾᎵᏍᏓᏁᏗ ᎨᏒ ᎾᏍᎩᏯ ᏄᏍᏕ ᏚᏁᏤᎴᎢ.

source: And he commandeth them, and saith unto them, 'I am being gathered unto my people; bury me by my fathers, at the cave which [is] in the field of Ephron the Hittite;
chr: ᎠᎴ ᏚᏁᏤᎴᎢ, ᎯᎠ ᏂᏚᏪᏎᎴᎢ; ᏗᏆᏤᎵᎦ ᏴᏫ ᏫᏄᎾᏛᏅ ᎠᏆᏖᎳᏗᏗ; ᏗᎩᎦᏴᎵᎨ ᏕᎨᏥᏂᏌᎲ ᏍᎩᏂᏌᏅᎭ, ᎢᏆᎶᏂ ᎠᎯᏗ ᎤᎶᎨᏛ ᎤᏍᏓᎦᎸᎢ,

source: in the cave which [is] in the field of Machpelah, which [is] on the front of Mamre, in the land of Canaan, which Abraham bought with the field from Ephron the Hittite for a possession of a burying-place;
chr: ᎹᎩᏈᎳ ᎦᎶᎨᏒ ᎤᏍᏓᎦᎸᎢ, ᎾᏍᎩ ᎹᎺᎵᏱ ᎢᎬᏱᏗᏢ, ᎾᏍᎩ ᎨᎾᏂᏱ ᎦᏙᎯ, ᎾᏍᎩ ᎡᏆᎭᎻ ᏧᏩᏎᎢ, ᎢᏆᎶᏂ ᎠᎯᏗ ᎤᎶᎨᏒ ᏧᎵᏠᏯᏍᏕᎢ, ᎾᏍᎩ ᎤᏤᎵ ᎢᏳᎵᏍᏙᏗᏱ ᏗᏓᏂᏐᏗᏱ.

source: (there they buried Abraham and Sarah his wife; there they buried Isaac and Rebekah his wife; and there I buried Leah);
chr: ᎾᎿ ᎡᏆᎭᎻ ᎠᎴ ᎤᏓᎵᎢ ᏎᎵ ᏚᏂᏂᏌᏁᎢ; ᎾᎿ ᎡᏏᎩ ᎠᎴ ᎵᏇᎩ ᎤᏓᎵᎢ ᏚᏂᏂᏌᏁᎢ; ᎠᎴ ᎾᎿ ᎵᎠ ᏥᏂᏌᏅᎩ.

source: the purchase of the field and of the cave which [is] in it, [is] from Sons of Heth.'
chr: ᎾᏍᎩ ᏠᎨᏏ, ᎠᎴ ᎾᎿ ᎤᏍᏓᎦᎸ ᎮᏗ ᏧᏪᏥ ᎨᏥᏩᎯᏎᎴᎢ.

source: And Jacob finisheth commanding his sons, and gathereth up his feet unto the bed, and expireth, and is gathered unto his people.
chr: ᏤᎦᏈᏃ ᎤᏍᏆᏛ ᏕᎧᏁᏤᎲ ᏧᏪᏥ, ᎤᏓᏯᏍᏔᏁ ᎠᏤᏍᏙᎩᎯ, ᎠᎴ ᎤᏲᎱᏎᎢ, ᎠᎴ ᏧᏤᎵᎦ ᏴᏫ ᏫᏄᎾᏛᏅ ᏭᏖᎳᏗᎴᎢ.

source: Chapter 50
chr: ᎠᏯᏙᎸᎢ 50

source: And Joseph falleth on his father's face, and weepeth over him, and kisseth him;
chr: ᏦᏩᏃ ᎤᏙᏓ ᎤᎧᏛ ᎤᏪᏯᎸᏤᎢ, ᎠᎴ ᎾᎿ ᏚᏠᏱᎴᎢ, ᎠᎴ ᎤᏔᏪᏙᏁᎢ.

source: and Joseph commandeth his servants, the physicians, to embalm his father, and the physicians embalm Israel;
chr: ᏦᏩᏃ ᏚᏁᏤᎴ ᏧᏅᏏᏓᏍᏗ ᏗᎾᏓᏅᏫᏍᎩ ᎦᏩᏒᎩ ᎤᏅᏙᏗᏱ ᎤᏂᏍᏆᏂᎪᏙᏗᏱ ᎤᏙᏓ; ᏗᎾᏓᏅᏫᏍᎩᏃ ᎤᏂᏍᏆᏂᎪᏔᏁ ᎢᏏᎵ.

source: and they fulfil for him forty days, for so they fulfil the days of the embalmed, and the Egyptians weep for him seventy days.
chr: ᏅᎦᏍᎪᎯᏃ ᏧᏒᎯᏛ ᎤᏂᎦᏘᏕᎢ; ᎾᏍᎩᏰᏃ ᎢᎪᎯᏛ ᎠᏂᎦᏘᏗᏍᎨ ᎦᏩᏒᎩ ᎬᏗ ᎠᏂᏍᏆᏂᎪᏗᏍᎬᎢ; ᎢᏥᏈᏱᏃ ᎦᎵᏆᏍᎪᎯ ᏧᏒᎯᏛ ᎬᏩᏍᎪᏂᎴᎢ.

source: And the days of his weeping pass away, and Joseph speaketh unto the house of Pharaoh, saying, 'If, I pray you, I have found grace in your eyes, speak, I pray you, in the ears of Pharaoh, saying,
chr: ᎿᏉᏃ ᎢᎪᎯᏛ ᎠᏥᏍᎪᏂᏍᏗ ᎨᏒ ᎤᎵᏍᏆᏛ, ᏦᏩ ᏚᏁᏤᎴ ᏇᎵᏲ ᏚᏓᏘᎾᎥᎢ, ᎯᎠ ᏄᏪᏎᎢ, ᎢᏳᏃ ᎣᏍᏛ ᏍᎩᏰᎸᏗᏱ ᎢᏨᏩᏛᎡᎴᏍᏗ, ᏇᎵᏲ ᎡᏥᏁᏥ, ᎯᎠ ᏁᏥᏪᏏ;

source: My father caused me to swear, saying, Lo, I am dying; in my burying-place which I have prepared for myself in the land of Canaan, there dost thou bury me; and now, let me go up, I pray thee, and bury my father, and return;'
chr: ᎡᏙᏓ ᎠᏆᏎᎵᏙᏔᏅᎩ, ᎯᎠ ᏄᏪᏒᎩ, ᎬᏂᏳᏉ, ᎠᎩᏲᎱᏏᏗ; ᎢᎬᏂᏐᏗᏱ, ᎾᏍᎩ ᎨᎾᏂᏱ ᎠᏆᏍᎪᏒᎯ, ᎾᎿ ᏍᎩᏂᏌᏅᎭ. ᎾᏍᎩ ᎢᏳᏍᏗ ᎿᏉ ᎨᎾ, ᎡᏙᏓ ᏥᏂᏌᏄᎦ, ᏔᎵᏁᏃ ᎢᏥᎷᏨᎭ.

source: and Pharaoh saith, 'Go up and bury thy father, as he caused thee to swear.'
chr: ᏇᎵᏲᏃ ᎯᎠ ᏄᏪᏎᎢ, ᎮᎾ, ᎯᏂᏌᏄᎦ ᏣᏙᏓ, ᎾᏍᎩᏯ ᏄᏪᏒᎢ ᏣᏎᎵᏙᏔᏅᎢ.

source: And Joseph goeth up to bury his father, and go up with him do all the servants of Pharaoh, elders of his house, and all the elders of the land of Egypt,
chr: ᏦᏩᏃ ᎤᏪᏅᏎ ᎤᏂᏌᏅᏎ ᎤᏙᏓ; ᎢᏧᎳᎭᏃ ᎤᏁᏅᏎ ᏂᎦᏛ ᏇᎵᏲ ᏧᏅᏏᏓᏍᏗ ᏂᎦᏛ ᏧᎾᏛᏐᏅᎯ ᎦᏁᎸ ᎠᏁᎯ, ᎠᎴ ᏂᎦᏛ ᏧᎾᏛᏐᏅᎯ ᎢᏥᏈᏱ ᎠᏁᎯ,

source: and all the house of Joseph, and his brethren, and the house of his father; only their infants, and their flock, and their herd, have they left in the land of Goshen;
chr: ᎠᎴ ᏂᎦᏛ ᏦᏩ ᏚᏓᏘᎿᎥᎢ, ᎠᎴ ᎠᎾᎵᏅᏟ, ᎠᎴ ᎤᏙᏓ ᏚᏓᏘᎾᎥᎢ; ᏧᏁᏥᏍᎩᏂᏃᏅ ᏧᎾᏍᏗᎦ, ᎠᎴ ᎠᏫ ᏧᎾᏤᎵ, ᎠᎴ ᏩᎦ ᏧᎾᏤᎵ ᎪᏌᏂᏱ ᏚᏂᎧᎯᏰᎢ.

source: and there go up with him both chariot and horsemen, and the camp is very great.
chr: ᎠᎴ ᎤᏁᎳᏛᏎ ᏓᏆᎴᎷ ᎠᎴ ᏐᏈᎵ ᏧᎾᎩᎸᏗ, ᎠᎴ ᏧᏈᏯ ᎨᏎ ᎤᎾᏓᏡᏩᏗᏒᎢ.

source: And they come unto the threshing-floor of Atad, which [is] beyond the Jordan, and they lament there, a lamentation great and very grievous; and he maketh for his father a mourning seven days,
chr: ᎠᏔᏗᏃ ᎤᎦᏔᏙᎥᏙᏗᏱ ᏭᏂᎷᏤᎢ, ᎾᏍᎩ ᏦᏓᏂ ᏍᎪᏂᏗᏢ ᏥᎩ, ᎾᎿᏃ ᎤᏣᏘ ᏚᏂᏴᎳᏎᎢ ᎡᎯᏍᏗ ᏚᎾᏠᏱᎴᎢ; ᎠᎴ ᎦᎵᏉᎩ ᏧᏒᎯᏛ ᎤᏙᏓ ᎤᏂᏍᎪᏂᏍᏗᏱ ᏄᏩᏁᎴᎢ.

source: and the inhabitant of the land, the Canaanite, see the mourning in the threshing-floor of Atad, and say, 'A grievous mourning [is] this to the Egyptians;' therefore hath [one] called its name 'The mourning of the Egyptians,' which [is] beyond the Jordan.
chr: ᎾᎿᏃ ᎠᏁᎯ ᎠᏂᎨᎾᏂ ᎤᏂᎪᎲ ᎠᏔᏗ ᎤᎦᏔᏙᎥᏙᏗᏱ ᏓᏂᏴᎬᎢ, ᎯᎠ ᏄᏂᏪᏎᎢ, ᎯᎠ ᎾᏍᎩ ᎤᏣᏘ ᏧᏂᏴᎵᏍᏗ ᏄᎾᎵᏍᏓᏏ ᎢᏥᏈᏱ ᎠᏁᎯ; ᎾᏍᎩ ᎢᏳᏍᏗ ᎢᏥᏈ-ᎠᏁᎯ-ᏧᏂᏴᎳᏍᏗᏱ ᏚᏃᎡ ᎾᎿᏂ, ᎾᏍᎩ ᏦᏓᏂ ᏍᎪᏂᏗᏢ ᏥᎩ.

source: And his sons do to him so as he commanded them,
chr: ᏧᏪᏥᏃ ᎾᏍᎩᏯ ᏂᏚᏪᏎᎸ ᏂᎬᏩᏛᏁᎴᎢ;

source: and his sons bear him away to the land of Canaan, and bury him in the cave of the field of Machpelah, which Abraham bought with the field for a possession of a burying-place, from Ephron the Hittite, on the front of Mamre.
chr: ᏧᏪᏥᏰᏃ ᎨᎾᏂ ᎦᏙᎯ ᏫᎬᏩᏅᏍᏔᏁᎢ, ᎠᎴ ᎤᏍᏓᎦᎸ ᎹᏈᎳ ᎦᎶᎨᏒ ᎬᏩᏂᏌᏁᎢ, ᎾᏍᎩ ᎹᎺᎵᏱ ᎢᎬᏱᏢ ᏥᎩ, ᎾᏍᎩ ᎡᏆᎭᎻ ᏧᏩᏎ ᏠᎨᏏ ᎬᏩᏠᏯᏍᏗ, ᎤᏤᎵ ᎢᏳᎵᏍᏙᏗᏱ ᏧᏓᏂᏐᏗᏱ, ᎾᏍᎩ ᎢᏆᎶᏂ ᎠᎯᏗ ᏧᏩᎯᏎᎴᎢ.

source: And Joseph turneth back to Egypt, he and his brethren, and all who are going up with him to bury his father, after his burying his father.
chr: ᏦᏩᏃ ᎢᏥᏈᏱ ᏫᎤᎶᏎᎢ, ᎤᏩᏒ ᎠᎴ ᎠᎾᎵᏅᏟ, ᎠᎴ ᏂᎦᏛ ᎢᏧᎳᎭ ᎤᏁᏅᏛ ᎤᏙᏓ ᎤᏂᏂᏌᏁᏅ, ᎾᏍᎩ ᎿᏉ ᎤᏙᏓ ᎤᏂᏌᏅ.

source: And the brethren of Joseph see that their father is dead, and say, 'Peradventure Joseph doth hate us, and doth certainly return to us all the evil which we did with him.'
chr: ᏦᏩᏃ ᎠᎾᎵᏅᏟ ᎤᏂᎪᎲ ᎤᏂᏙᏓ ᎤᏲᎱᏒᎢ, ᎯᎠ ᏄᏂᏪᏎᎢ, ᏦᏩ ᏱᎩ ᎤᏲ ᏱᏂᎬᎾᏕᎦ, ᎠᎴ ᏴᎦᏞᏥᏏ ᏂᎦᎥ ᎤᏲ ᏁᏛᏁᎸᎢ.

source: And they give a charge for Joseph, saying, 'Thy father commanded before his death, saying,
chr: ᎤᎾᏓᏅᏎᏃ ᎯᎠ ᏫᏄᏂᏪᏎᎴ ᏦᏩ; ᏣᏙᏓ ᎤᏁᏨᎩ ᎠᏏᏉ ᎾᏲᎱᏍᎬᎾ ᏥᎨᏒᎩ, ᎯᎠ ᏄᏪᏒᎩ;

source: Thus ye do say to Joseph, I pray thee, bear, I pray thee, with the transgression of thy brethren, and their sin, for they have done thee evil; and now, bear, we pray thee, with the transgression of the servants of the God of thy father;' and Joseph weepeth in their speaking unto him.
chr: ᎯᎠ ᎾᏍᎩ ᏁᏥᏪᏎᎸᎭ ᏦᏩ, ᏗᎨᎯᎲᏏ ᎢᏣᎵᏅᏟ ᎤᏂᏍᎦᏅᏨᎢ, ᎤᏲ ᏄᎾᏛᏁᎸᎢ; ᏂᎯᏰᏃ ᎤᏲ ᏂᎨᏨᏁᎸᎩ. ᎾᏍᎩᏃ ᎿᏉ ᏣᏙᏓ ᎤᏤᎵᎦ ᎤᏁᎳᏅᎯ ᎣᎩᏅᏏᏓᏍᏗ ᏗᎨᏍᎩᎲᏏ ᎣᎩᏍᎦᏅᏨᎢ. ᏦᏩᏃ ᏚᏠᏱᎴ ᎬᏩᏬᏁᏔᏅ.

source: And his brethren also go and fall before him, and say, 'Lo, we [are] to thee for servants.'
chr: ᎠᎴ ᎠᎾᎵᏅᏟ ᎤᏁᏅᏎ ᎾᏍᏉ ᎠᎴ ᎡᎳᏗ ᏫᏂᎬᏩᏛᏁᎴᎢ; ᎠᎴ ᎯᎠ ᏄᏂᏪᏎᎢ, ᎬᏂᏳᏉ ᏂᎯ ᏍᎩᏅᏏᏓᏍᏗ.

source: And Joseph saith unto them, 'Fear not, for [am] I in the place of God?
chr: ᏦᏩᏃ ᎯᎠ ᏂᏚᏪᏎᎴᎢ, ᏞᏍᏗ ᏱᏥᏍᎦᎢᎮᏍᏗ; ᎠᏴᏰᏃ ᎨᏒ, ᏥᎪ ᎤᏁᎳᏅᎯ ᏥᏯᏓᏁᏟᏴᏍᏓᏁᎸ?

source: As for you, ye devised against me evil -- God devised it for good, in order to do as [at] this day, to keep alive a numerous people;
chr: ᏂᎯᏍᎩᏂ, ᎤᏲ ᏍᎩᏯᏓᏅᏖᏍᎬᎩ, ᎤᏁᎳᏅᎯᏍᎩᏂ ᎣᏍᏛ ᎠᏓᏅᏖᏍᎬᎩ, ᎪᎯ ᎢᎦ ᎨᏒ ᏂᏄᏍᏗ ᎢᏳᏩᏁᏗᏱ, ᎤᏂᏣᏘ ᏴᏫ ᏓᏅᏅ ᏧᏍᏕᎸᏗᏱ.

source: and now, fear not: I do nourish you and your infants;' and he comforteth them, and speaketh unto their heart.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᏞᏍᏗ ᏱᏥᏍᎦᎢᎮᏍᏗ, ᏓᏨᏰᎶᎵ, ᏂᎯ ᎠᎴ ᏗᏤᏥ ᏧᎾᏍᏗᎦ, ᎦᏚᎵᏍᏓᏕᏃ, ᎠᎴ ᎤᏓᏅᏘ ᏚᏬᏁᏔᏁᎢ.

source: And Joseph dwelleth in Egypt, he and the house of his father, and Joseph liveth a hundred and ten years,
chr: ᏦᏩᏃ ᎢᏥᏈᏱ ᎡᎮᎢ, ᎤᏩᏒ ᎠᎴ ᎤᏙᏓ ᏚᏓᏘᎾᎥᎢ; ᏦᏩᏃ ᎠᏍᎪᎯᏧᏈ ᎠᏍᎪᎯᏃ ᏧᏕᏘᏴᏛ ᎤᎴᏂᏙᎴᎢ.

source: and Joseph looketh on Ephraim's sons of the third [generation]; sons also of Machir, son of Manasseh, have been born on the knees of Joseph.
chr: ᏦᏩᏃ ᏚᎪᎮ ᎢᏆᎻ ᏧᏪᏥ ᏦᎢᏁ ᎤᎾᏓᎵᏴᏛ, ᎠᎴ ᎾᏍᎪ ᏦᏩ ᏗᎧᏂᎨᏂ ᏕᎨᎦᏛᎯᏍᏔᏁ ᎺᎦ ᏧᏪᏥ ᎾᏍᎩ ᎻᎾᏌ ᎤᏪᏥ ᏥᎨᏎᎢ.

source: And Joseph saith unto his brethren, 'I am dying, and God doth certainly inspect you, and hath caused you to go up from this land, unto the land which He hath sworn to Abraham, to Isaac, and to Jacob.'
chr: ᏦᏩᏃ ᎯᎠ ᏂᏚᏪᏎᎴ ᎠᎾᎵᏅᏟ, ᎠᎩᏲᎱᏏᏗ; ᎠᎴ ᎤᏁᎳᏅᎯ ᎤᏙᎯᏳᎯᏯ ᏓᏥᏩᏛᎯᎵ, ᎠᎴ ᎠᏂ ᎦᏙᎯ ᏙᏓᏣᏘᎾᏫᏛᎯ; ᏫᏙᏓᏣᏘᏃᎵ ᎾᎿ ᎦᏙᎯ ᏧᏁᏁᏗᏱ ᏥᏚᏎᎵᏓᏁᎴ ᎡᏆᎭᎻ, ᎠᎴ ᎡᏏᎩ, ᎠᎴ ᏤᎦᏈ.

source: And Joseph causeth the sons of Israel to swear, saying, 'God doth certainly inspect you, and ye have brought up my bones from this [place].'
chr: ᏦᏩᏃ ᏚᏎᎵᏙᏔᏁ ᎢᏏᎵ ᏧᏪᏥ, ᎯᎠ ᏄᏪᏎᎢ; ᎤᏁᎳᏅᎯ ᎤᏙᎯᏳᎯᏯ ᏓᏥᏩᏛᎯᎵ, ᎠᎴ ᏗᎩᎪᎳ ᎠᏂ ᏕᏥᏴᏫᏛᎲᎭ.

source: And Joseph dieth, a son of an hundred and ten years, and they embalm him, and he is put into a coffin in Egypt.
chr: ᏦᏩᏃ ᎤᏲᎱᏎᎢ, ᎠᏍᎪᎯᏧᏈ ᎠᏍᎪᎯᏃ ᎢᏳᏕᏘᏴᏛ ᎨᏎᎢ; ᎦᏩᏒᎩᏃ ᎬᏘ ᏆᏍᏆᏂᎪᏔᏁᎢ, ᎢᏥᏈᏱᏃ ᎦᏁᏌᎢᏱ ᎬᏩᎸᏁᎢ.
